/**************************************************************************/
/*                         This file is part of:                          */
/*                             GODOT ENGINE                               */
/*                        https://godotengine.org                         */
/**************************************************************************/

#pragma once

#include "test_macros.h"

#include <cstring>
#include <cstddef>

#include "core/config/project_settings.h"
#include "core/variant/variant.h"
#include "../core/gaussian_data.h"
#include "../core/gaussian_splat_manager.h"
#include "../core/gaussian_streaming.h"
#include "../renderer/gaussian_gpu_layout.h"
#include "../renderer/gpu_sorting_config.h"
#include "../renderer/gaussian_splat_renderer.h"
#include "../renderer/render_debug_state_orchestrator.h"
#include "../renderer/render_instancing_orchestrator.h"
#include "../renderer/render_pipeline_stages.h"
#include "../interfaces/gpu_sorting_pipeline.h"
#include "../interfaces/output_compositor.h"
#include "servers/rendering/rendering_device.h"
#include "servers/rendering_server.h"
#include "servers/rendering/renderer_rd/storage_rd/texture_storage.h"
#include "servers/rendering/renderer_rd/storage_rd/render_data_rd.h"
#include "servers/rendering/renderer_rd/storage_rd/render_scene_data_rd.h"
#include "servers/rendering/storage/render_scene_buffers.h"

namespace TestGaussianSplatting {

static_assert(GS_RENDER_PARAMS_LAYOUT_VERSION == 16, "Render params layout version mismatch");

static_assert(sizeof(InstanceDataGPU) == 96, "InstanceDataGPU size contract changed");
static_assert(offsetof(InstanceDataGPU, lod) == 72, "InstanceDataGPU.lod offset contract changed");
static_assert(offsetof(InstanceDataGPU, wind_params) == 80, "InstanceDataGPU.wind_params offset contract changed");
static_assert(sizeof(AssetMetaGPU) == 112, "AssetMetaGPU size contract changed");
static_assert(offsetof(AssetMetaGPU, lod_ranges) == 48, "AssetMetaGPU.lod_ranges offset contract changed");
static_assert(sizeof(ChunkMetaGPU) == 64, "ChunkMetaGPU size contract changed");
static_assert(offsetof(ChunkMetaGPU, sh_limit) == 44, "ChunkMetaGPU.sh_limit offset contract changed");
static_assert(sizeof(SplatRefGPU) == 8, "SplatRefGPU size contract changed");
static_assert(sizeof(PackedGaussian) == 144, "PackedGaussian size contract changed");
static_assert(offsetof(PackedGaussian, rotation) == 32, "PackedGaussian.rotation offset contract changed");
static_assert(offsetof(PackedGaussian, sh) == 48, "PackedGaussian.sh offset contract changed");
static_assert(offsetof(PackedGaussian, sh_metadata) == 140, "PackedGaussian.sh_metadata offset contract changed");
static_assert(sizeof(PackedGaussianF16) == 144, "PackedGaussianF16 size contract changed");
static_assert(sizeof(PackedGaussianQuantized) == 80, "PackedGaussianQuantized size contract changed");
static_assert(sizeof(TileRenderParamsGPU) == 720, "TileRenderParamsGPU size contract changed");
static_assert(offsetof(TileRenderParamsGPU, viewport_size) == 256, "TileRenderParamsGPU.viewport_size offset contract changed");
static_assert(offsetof(TileRenderParamsGPU, camera_position) == 320, "TileRenderParamsGPU.camera_position offset contract changed");
static_assert(offsetof(TileRenderParamsGPU, lighting_mode) == 560, "TileRenderParamsGPU.lighting_mode offset contract changed");
static_assert(offsetof(TileRenderParamsGPU, instance_rotation_inv_col2) == 640, "TileRenderParamsGPU.instance_rotation_inv_col2 offset contract changed");
static_assert(offsetof(TileRenderParamsGPU, wind_dir_strength) == 656, "TileRenderParamsGPU.wind_dir_strength offset contract changed");
static_assert(offsetof(TileRenderParamsGPU, wind_time_config) == 672, "TileRenderParamsGPU.wind_time_config offset contract changed");
static_assert(offsetof(TileRenderParamsGPU, effector_sphere) == 688, "TileRenderParamsGPU.effector_sphere offset contract changed");
static_assert(offsetof(TileRenderParamsGPU, effector_config) == 704, "TileRenderParamsGPU.effector_config offset contract changed");

// Utility to ensure we have a GaussianSplatManager available during the test run.
// Note: Named with "Pipeline" suffix to avoid redefinition with test_render_validation.h
class ScopedGaussianManagerPipeline {
    GaussianSplatManager *manager = nullptr;
    bool owns_instance = false;

public:
    ScopedGaussianManagerPipeline() {
        manager = GaussianSplatManager::get_singleton();
        if (!manager) {
            manager = memnew(GaussianSplatManager);
            owns_instance = true;
        }
    }

    ~ScopedGaussianManagerPipeline() {
        if (owns_instance && manager) {
            memdelete(manager);
        }
    }

    GaussianSplatManager *get() const { return manager; }
};

class ScopedProjectSetting {
    ProjectSettings *settings = nullptr;
    String setting_path;
    Variant previous_value;
    bool had_previous_value = false;

