/*
  Simple DirectMedia Layer
  Copyright (C) 1997-2025 Sam Lantinga <slouken@libsdl.org>

  This software is provided 'as-is', without any express or implied
  warranty.  In no event will the authors be held liable for any damages
  arising from the use of this software.

  Permission is granted to anyone to use this software for any purpose,
  including commercial applications, and to alter it and redistribute it
  freely, subject to the following restrictions:

  1. The origin of this software must not be misrepresented; you must not
     claim that you wrote the original software. If you use this software
     in a product, an acknowledgment in the product documentation would be
     appreciated but is not required.
  2. Altered source versions must be plainly marked as such, and must not be
     misrepresented as being the original software.
  3. This notice may not be removed or altered from any source distribution.
*/
#include "SDL_internal.h"

#ifdef SDL_JOYSTICK_HIDAPI

#include "../../SDL_hints_c.h"
#include "../SDL_sysjoystick.h"
#include "SDL_hidapijoystick_c.h"
#include "SDL_hidapi_rumble.h"

#ifdef SDL_JOYSTICK_HIDAPI_PS5

// Define this if you want to log all packets from the controller
#if 0
#define DEBUG_PS5_PROTOCOL
#endif

// Define this if you want to log calibration data
#if 0
#define DEBUG_PS5_CALIBRATION
#endif

#define GYRO_RES_PER_DEGREE             1024.0f
#define ACCEL_RES_PER_G                 8192.0f
#define BLUETOOTH_DISCONNECT_TIMEOUT_MS 500

#define LOAD16(A, B)       (Sint16)((Uint16)(A) | (((Uint16)(B)) << 8))
#define LOAD32(A, B, C, D) ((((Uint32)(A)) << 0) |  \
                            (((Uint32)(B)) << 8) |  \
                            (((Uint32)(C)) << 16) | \
                            (((Uint32)(D)) << 24))

enum
{
    SDL_GAMEPAD_BUTTON_PS5_TOUCHPAD = 11,
    SDL_GAMEPAD_BUTTON_PS5_MICROPHONE,
    SDL_GAMEPAD_BUTTON_PS5_LEFT_FUNCTION,
    SDL_GAMEPAD_BUTTON_PS5_RIGHT_FUNCTION,
    SDL_GAMEPAD_BUTTON_PS5_LEFT_PADDLE,
    SDL_GAMEPAD_BUTTON_PS5_RIGHT_PADDLE
};

typedef enum
{
    k_EPS5ReportIdState = 0x01,
    k_EPS5ReportIdUsbEffects = 0x02,
    k_EPS5ReportIdBluetoothEffects = 0x31,
    k_EPS5ReportIdBluetoothState = 0x31,
} EPS5ReportId;

typedef enum
{
    k_EPS5FeatureReportIdCapabilities = 0x03,
    k_EPS5FeatureReportIdCalibration = 0x05,
    k_EPS5FeatureReportIdSerialNumber = 0x09,
    k_EPS5FeatureReportIdFirmwareInfo = 0x20,
} EPS5FeatureReportId;

typedef struct
{
    Uint8 ucLeftJoystickX;
    Uint8 ucLeftJoystickY;
    Uint8 ucRightJoystickX;
    Uint8 ucRightJoystickY;
    Uint8 rgucButtonsHatAndCounter[3];
    Uint8 ucTriggerLeft;
    Uint8 ucTriggerRight;
} PS5SimpleStatePacket_t;

typedef struct
{
    Uint8 ucLeftJoystickX;        // 0
    Uint8 ucLeftJoystickY;        // 1
    Uint8 ucRightJoystickX;       // 2
    Uint8 ucRightJoystickY;       // 3
    Uint8 ucTriggerLeft;          // 4
    Uint8 ucTriggerRight;         // 5
    Uint8 ucCounter;              // 6
    Uint8 rgucButtonsAndHat[4];   // 7
    Uint8 rgucPacketSequence[4];  // 11 - 32 bit little endian
    Uint8 rgucGyroX[2];           // 15
    Uint8 rgucGyroY[2];           // 17
    Uint8 rgucGyroZ[2];           // 19
    Uint8 rgucAccelX[2];          // 21
    Uint8 rgucAccelY[2];          // 23
    Uint8 rgucAccelZ[2];          // 25
    Uint8 rgucSensorTimestamp[4]; // 27 - 16/32 bit little endian

} PS5StatePacketCommon_t;

typedef struct
{
    Uint8 ucLeftJoystickX;        // 0
    Uint8 ucLeftJoystickY;        // 1
    Uint8 ucRightJoystickX;       // 2
    Uint8 ucRightJoystickY;       // 3
    Uint8 ucTriggerLeft;          // 4
    Uint8 ucTriggerRight;         // 5
    Uint8 ucCounter;              // 6
    Uint8 rgucButtonsAndHat[4];   // 7
    Uint8 rgucPacketSequence[4];  // 11 - 32 bit little endian
    Uint8 rgucGyroX[2];           // 15
    Uint8 rgucGyroY[2];           // 17
    Uint8 rgucGyroZ[2];           // 19
    Uint8 rgucAccelX[2];          // 21
    Uint8 rgucAccelY[2];          // 23
    Uint8 rgucAccelZ[2];          // 25
    Uint8 rgucSensorTimestamp[4]; // 27 - 32 bit little endian
    Uint8 ucSensorTemp;           // 31
    Uint8 ucTouchpadCounter1;     // 32 - high bit clear + counter
    Uint8 rgucTouchpadData1[3];   // 33 - X/Y, 12 bits per axis
    Uint8 ucTouchpadCounter2;     // 36 - high bit clear + counter
    Uint8 rgucTouchpadData2[3];   // 37 - X/Y, 12 bits per axis
    Uint8 rgucUnknown1[8];        // 40
    Uint8 rgucTimer2[4];          // 48 - 32 bit little endian
    Uint8 ucBatteryLevel;         // 52
    Uint8 ucConnectState;         // 53 - 0x08 = USB, 0x01 = headphone

    // There's more unknown data at the end, and a 32-bit CRC on Bluetooth
} PS5StatePacket_t;

typedef struct
{
    Uint8 ucLeftJoystickX;        // 0
    Uint8 ucLeftJoystickY;        // 1
    Uint8 ucRightJoystickX;       // 2
    Uint8 ucRightJoystickY;       // 3
    Uint8 ucTriggerLeft;          // 4
    Uint8 ucTriggerRight;         // 5
    Uint8 ucCounter;              // 6
    Uint8 rgucButtonsAndHat[4];   // 7
    Uint8 rgucPacketSequence[4];  // 11 - 32 bit little endian
    Uint8 rgucGyroX[2];           // 15
    Uint8 rgucGyroY[2];           // 17
    Uint8 rgucGyroZ[2];           // 19
    Uint8 rgucAccelX[2];          // 21
    Uint8 rgucAccelY[2];          // 23
    Uint8 rgucAccelZ[2];          // 25
    Uint8 rgucSensorTimestamp[2]; // 27 - 16 bit little endian
    Uint8 ucBatteryLevel;         // 29
    Uint8 ucUnknown;              // 30
    Uint8 ucTouchpadCounter1;     // 31 - high bit clear + counter
    Uint8 rgucTouchpadData1[3];   // 32 - X/Y, 12 bits per axis
    Uint8 ucTouchpadCounter2;     // 35 - high bit clear + counter
    Uint8 rgucTouchpadData2[3];   // 36 - X/Y, 12 bits per axis

    // There's more unknown data at the end, and a 32-bit CRC on Bluetooth
} PS5StatePacketAlt_t;

typedef struct
{
    Uint8 ucEnableBits1;              // 0
    Uint8 ucEnableBits2;              // 1
    Uint8 ucRumbleRight;              // 2
    Uint8 ucRumbleLeft;               // 3
    Uint8 ucHeadphoneVolume;          // 4
    Uint8 ucSpeakerVolume;            // 5
    Uint8 ucMicrophoneVolume;         // 6
    Uint8 ucAudioEnableBits;          // 7
    Uint8 ucMicLightMode;             // 8
    Uint8 ucAudioMuteBits;            // 9
    Uint8 rgucRightTriggerEffect[11]; // 10
    Uint8 rgucLeftTriggerEffect[11];  // 21
    Uint8 rgucUnknown1[6];            // 32
    Uint8 ucEnableBits3;              // 38
    Uint8 rgucUnknown2[2];            // 39
    Uint8 ucLedAnim;                  // 41
    Uint8 ucLedBrightness;            // 42
    Uint8 ucPadLights;                // 43
    Uint8 ucLedRed;                   // 44
    Uint8 ucLedGreen;                 // 45
    Uint8 ucLedBlue;                  // 46
} DS5EffectsState_t;

typedef enum
{
    k_EDS5EffectRumbleStart = (1 << 0),
    k_EDS5EffectRumble = (1 << 1),
    k_EDS5EffectLEDReset = (1 << 2),
    k_EDS5EffectLED = (1 << 3),
    k_EDS5EffectPadLights = (1 << 4),
    k_EDS5EffectMicLight = (1 << 5)
} EDS5Effect;

typedef enum
{
    k_EDS5LEDResetStateNone,
    k_EDS5LEDResetStatePending,
    k_EDS5LEDResetStateComplete,
} EDS5LEDResetState;

typedef struct
{
    Sint16 bias;
    float sensitivity;
} IMUCalibrationData;

/* Rumble hint mode:
 * "0": enhanced features are never used
 * "1": enhanced features are always used
 * "auto": enhanced features are advertised to the application, but SDL doesn't touch the controller state unless the application explicitly requests it.
 */
typedef enum
{
    PS5_ENHANCED_REPORT_HINT_OFF,
    PS5_ENHANCED_REPORT_HINT_ON,
    PS5_ENHANCED_REPORT_HINT_AUTO
} HIDAPI_PS5_EnhancedReportHint;

typedef struct
{
    SDL_HIDAPI_Device *device;
